{
  "fileName": "Upnp.scala",
  "filePath": "flow/src/main/scala/org/alephium/flow/network/nat/Upnp.scala",
  "url": "https://github.com/alephium/alephium/blob/master/flow/src/main/scala/org/alephium/flow/network/nat/Upnp.scala",
  "summary": "This file contains the implementation of the UPnP (Universal Plug and Play) protocol for the Alephium project. UPnP is a set of networking protocols that allow devices to discover each other on a network and establish communication for data sharing, communication, and entertainment. The purpose of this code is to enable the Alephium node to automatically configure the network router to allow incoming connections from other nodes on the network. \n\nThe `Upnp` object contains the main functionality of the UPnP protocol. It provides a method `getUpnpClient` that returns an instance of `UpnpClient` if a valid UPnP gateway device is found on the network. The `UpnpClient` class represents a UPnP gateway device and provides methods to add and delete port mappings on the device. \n\nThe `addPortMapping` method adds a port mapping on the UPnP gateway device to forward incoming traffic from the specified external port to the specified internal port on the local machine. The method returns `true` if the port mapping was successfully added for both TCP and UDP protocols, and `false` otherwise. The `deletePortMapping` method removes the port mapping for the specified external port on both TCP and UDP protocols. \n\nThe `Upnp` object also defines some constants such as `tcp`, `udp`, `protocols`, and `description`. `tcp` and `udp` are strings representing the TCP and UDP protocols respectively. `protocols` is an immutable `ArraySeq` containing both TCP and UDP protocols. `description` is a string representing the description of the port mapping. \n\nThe code uses the `GatewayDiscover` class from the `org.bitlet.weupnp` package to discover UPnP gateway devices on the network. It sets the HTTP read timeout and discovery timeout based on the `UpnpSettings` provided. If a valid UPnP gateway device is found, it creates an instance of `UpnpClient` and returns it. \n\nOverall, this code enables the Alephium node to automatically configure the network router to allow incoming connections from other nodes on the network. It provides a simple and efficient way to establish communication between nodes without requiring manual configuration of the network router. \n\nExample usage:\n\n```scala\nval upnpSettings = UpnpSettings(httpTimeout = Some(5.seconds), discoveryTimeout = Some(10.seconds))\nval upnpClientOpt = Upnp.getUpnpClient(upnpSettings)\n\nupnpClientOpt match {\n  case Some(upnpClient) =>\n    val externalPort = 12345\n    val internalPort = 54321\n    if (upnpClient.addPortMapping(externalPort, internalPort)) {\n      println(s\"Port mapping added for external port $externalPort and internal port $internalPort\")\n    } else {\n      println(s\"Failed to add port mapping for external port $externalPort and internal port $internalPort\")\n    }\n  case None =>\n    println(\"No valid UPnP gateway device found on the network\")\n}\n```",
  "questions": "1. What is the purpose of this code?\n    \n    This code provides functionality for mapping external ports to internal ports using UPnP protocol. It is part of the Alephium project and is licensed under GNU Lesser General Public License.\n\n2. What is the role of the `Upnp` object?\n    \n    The `Upnp` object contains constants and a method for discovering and creating an instance of `UpnpClient` based on the provided `UpnpSettings`. It also logs debug and error messages using `StrictLogging`.\n\n3. What is the purpose of the `UpnpClient` class?\n    \n    The `UpnpClient` class provides methods for adding and deleting port mappings using the `GatewayDevice` instance provided in the constructor. It also logs debug and error messages using `StrictLogging`."
}