{
  "fileName": "Sweep.scala",
  "filePath": "wallet/src/main/scala/org/alephium/wallet/api/model/Sweep.scala",
  "url": "https://github.com/alephium/alephium/blob/master/wallet/src/main/scala/org/alephium/wallet/api/model/Sweep.scala",
  "summary": "The `Sweep` class is a model in the `org.alephium.wallet.api.model` package of the Alephium project. It represents a request to sweep all available funds from a given address to another address. \n\nThe class has six parameters: \n- `toAddress`: the address to which the funds will be swept.\n- `lockTime`: an optional parameter that specifies the lock time for the transaction.\n- `gasAmount`: an optional parameter that specifies the amount of gas to be used for the transaction.\n- `gasPrice`: an optional parameter that specifies the gas price for the transaction.\n- `utxosLimit`: an optional parameter that specifies the maximum number of unspent transaction outputs (UTXOs) to be used for the transaction.\n- `targetBlockHash`: an optional parameter that specifies the target block hash for the transaction.\n\nThe `Sweep` class extends the `BuildTxCommon` trait from the `org.alephium.api.model` package, which provides common functionality for building transactions.\n\nThis class can be used in the larger project to facilitate the sweeping of funds from one address to another. For example, a user may want to sweep all available funds from a cold storage address to a hot wallet address. The `Sweep` class can be used to construct the transaction request with the desired parameters, which can then be sent to the Alephium network for processing. \n\nHere is an example of how the `Sweep` class can be used:\n\n```scala\nimport org.alephium.wallet.api.model.Sweep\nimport org.alephium.protocol.model.Address.Asset\n\nval fromAddress: Asset = ???\nval toAddress: Asset = ???\n\nval sweepRequest = Sweep(toAddress)\n\n// Optional parameters can also be specified\nsweepRequest.lockTime = Some(1234567890L)\nsweepRequest.gasAmount = Some(GasBox(1000000L))\nsweepRequest.gasPrice = Some(GasPrice(100L))\nsweepRequest.utxosLimit = Some(10)\nsweepRequest.targetBlockHash = Some(BlockHash(\"abcd1234\"))\n\n// Send the sweep request to the Alephium network for processing\nval txHash = sendSweepRequest(fromAddress, sweepRequest)\n``` \n\nIn this example, a `Sweep` request is created with the `toAddress` parameter set to the desired destination address. Optional parameters are also set to specify the lock time, gas amount, gas price, UTXO limit, and target block hash. Finally, the `sendSweepRequest` function is called with the `fromAddress` and `sweepRequest` parameters to send the request to the Alephium network for processing.",
  "questions": "1. What is the purpose of the `Sweep` case class?\n- The `Sweep` case class is used to represent a request to sweep all UTXOs from a given address to a specified destination address.\n\n2. What is the significance of the `BuildTxCommon` trait?\n- The `BuildTxCommon` trait is a common interface for building transactions in the Alephium API.\n\n3. What are the optional parameters in the `Sweep` case class?\n- The optional parameters in the `Sweep` case class are `lockTime`, `gasAmount`, `gasPrice`, `utxosLimit`, and `targetBlockHash`. These parameters allow for customization of the sweep transaction."
}