{
  "fileName": "MutBalancesPerLockup.scala",
  "filePath": "protocol/src/main/scala/org/alephium/protocol/vm/MutBalancesPerLockup.scala",
  "url": "https://github.com/alephium/alephium/blob/master/protocol/src/main/scala/org/alephium/protocol/vm/MutBalancesPerLockup.scala",
  "summary": "The `MutBalancesPerLockup` class is a data structure that represents the balances of a lockup script in the Alephium blockchain. It contains the balance of Alephium (ALPH) and a map of token balances, where the keys are token IDs and the values are the corresponding token balances. The class also keeps track of the scope depth of the lockup script.\n\nThe class provides methods to add and subtract balances of ALPH and tokens, as well as to retrieve the balance of a specific token. It also provides methods to convert the balances to transaction outputs, which can be used to create transactions that transfer the balances to other lockup scripts or to regular addresses.\n\nThe `toTxOutput` method is used to convert the balances to transaction outputs. It takes a `LockupScript` object and a `HardFork` object as parameters. The `LockupScript` object represents the lockup script that the balances belong to, and the `HardFork` object represents the current state of the blockchain with respect to hard forks. The method checks whether the balances are valid for the given lockup script and hard fork, and returns an `ExeResult` object that contains either an error message or a vector of transaction outputs.\n\nThe `MutBalancesPerLockup` class is used extensively in the Alephium blockchain to represent the balances of lockup scripts. It is used in the validation of transactions and blocks, as well as in the creation of new transactions. For example, when a user wants to transfer ALPH or tokens to another lockup script or to a regular address, the user creates a transaction that contains one or more inputs from the user's lockup script and one or more outputs to the recipient's lockup script or address. The `MutBalancesPerLockup` class is used to calculate the input and output balances of the transaction, and to validate that the transaction is valid with respect to the balances of the lockup scripts involved.\n\nExample usage:\n\n```scala\n// create a new MutBalancesPerLockup object with zero balances\nval balances = MutBalancesPerLockup.empty\n\n// add 100 ALPH to the balances\nbalances.addAlph(U256.fromBigInt(100))\n\n// add 50 tokens with ID 1 to the balances\nbalances.addToken(TokenId(1), U256.fromBigInt(50))\n\n// convert the balances to transaction outputs for a lockup script\nval lockupScript = LockupScript.Asset(...)\nval hardFork = HardFork(...)\nval txOutputs = balances.toTxOutput(lockupScript, hardFork)\n```",
  "questions": "1. What is the purpose of the `MutBalancesPerLockup` class?\n- The `MutBalancesPerLockup` class represents mutable balances for a lockup script, including balances of Alphium and other tokens.\n \n2. What is the difference between `toTxOutputLeman` and `toTxOutputDeprecated` methods?\n- The `toTxOutputLeman` method is used when the Leman hard fork is enabled and creates a `ContractOutput` if the lockup script is a `LockupScript.P2C`. The `toTxOutputDeprecated` method is used when the Leman hard fork is not enabled and creates a regular `TxOutput`.\n\n3. What is the purpose of the `error` field in the `MutBalancesPerLockup` object?\n- The `error` field is an `ArithmeticException` that is thrown when there is an error updating the balances in the `MutBalancesPerLockup` class."
}