{
  "fileName": "Balance.scala",
  "filePath": "api/src/main/scala/org/alephium/api/model/Balance.scala",
  "url": "https://github.com/alephium/alephium/blob/master/api/src/main/scala/org/alephium/api/model/Balance.scala",
  "summary": "The `Balance` object is a Scala case class that represents the balance of an account on the Alephium blockchain. It contains information about the account's balance, locked balance, token balances, locked token balances, number of UTXOs (unspent transaction outputs), and an optional warning message.\n\nThe `Balance` object has two factory methods: `from` and `from`. The first `from` method takes in the balance, locked balance, token balances, locked token balances, UTXO number, and an optional warning message, and returns a new `Balance` object with the same fields. The second `from` method takes in a tuple of balance, locked balance, token balances, locked token balances, and UTXO number, as well as a UTXO limit, and returns a new `Balance` object with the same fields. The second `from` method is used to create a `Balance` object from a tuple of values returned by the Alephium blockchain.\n\nThe `Balance` object also has a private helper method called `getTokenBalances` that takes in a vector of token balances and returns an optional vector of `Token` objects. The `Token` object represents a token on the Alephium blockchain and contains information about the token's ID and balance.\n\nOverall, the `Balance` object is an important part of the Alephium blockchain API as it provides information about the balance of an account on the blockchain. It can be used by developers to build applications that interact with the Alephium blockchain, such as wallets or exchanges. Below is an example of how the `Balance` object can be used to get the balance of an account:\n\n```scala\nimport org.alephium.api.model.Balance\n\nval balance = Balance.from(\n  balance = 1000,\n  lockedBalance = 500,\n  tokenBalances = Some(Vector(Token(1, 200), Token(2, 300))),\n  lockedTokenBalances = Some(Vector(Token(1, 100))),\n  utxoNum = 10,\n  warning = Some(\"Result might not include all utxos and is maybe unprecise\")\n)\n\nprintln(balance.balance) // prints 1000\nprintln(balance.tokenBalances.get) // prints Vector(Token(1, 200), Token(2, 300))\n```",
  "questions": "1. What is the purpose of the `Balance` class and what does it represent?\n- The `Balance` class represents the balance of an account, including the amount of tokens and locked tokens, as well as the number of unspent transaction outputs (UTXOs) associated with the account.\n\n2. What is the difference between `tokenBalances` and `lockedTokenBalances`?\n- `tokenBalances` represents the balances of regular tokens, while `lockedTokenBalances` represents the balances of tokens that are currently locked and cannot be spent.\n\n3. What is the purpose of the `from` methods in the `Balance` object?\n- The `from` methods are used to create a `Balance` instance from different input formats, such as a tuple of balances and UTXO information or individual balance and token balance values."
}