{
  "fileName": "GasEstimation.scala",
  "filePath": "flow/src/main/scala/org/alephium/flow/gasestimation/GasEstimation.scala",
  "url": "https://github.com/alephium/alephium/blob/master/flow/src/main/scala/org/alephium/flow/gasestimation/GasEstimation.scala",
  "summary": "The `GasEstimation` object in the `org.alephium.flow.gasestimation` package provides functions for estimating the amount of gas required to execute various types of scripts in the Alephium blockchain. Gas is a measure of computational effort required to execute a script, and is used to determine the fee paid by the sender of a transaction.\n\nThe `GasEstimation` object provides several functions for estimating gas usage:\n\n- `sweepAddress`: estimates the gas required to sweep an address with P2PKH inputs.\n- `estimateWithP2PKHInputs`: estimates the gas required for a transaction with P2PKH inputs.\n- `estimateWithInputScript`: estimates the gas required for a transaction with a given unlock script.\n- `estimate`: estimates the gas required for a transaction with a vector of unlock scripts and a given number of outputs.\n- `estimate`: estimates the gas required to execute a given stateful script.\n\nThe `GasEstimation` object depends on several other classes in the Alephium project, including `GasSchedule`, `UnlockScript`, `AssetScriptGasEstimator`, `StatefulScript`, and `TxScriptGasEstimator`. These classes provide information about gas costs for various types of scripts and operations.\n\nThe `GasEstimation` object is used in the larger Alephium project to determine the fee paid by the sender of a transaction. The fee is calculated as the product of the gas used and the gas price, which is set by the network. By accurately estimating the gas required for a transaction, the sender can ensure that they pay a fair fee and that their transaction is processed in a timely manner.\n\nExample usage:\n\n```scala\nimport org.alephium.flow.gasestimation._\n\nval numInputs = 2\nval numOutputs = 1\nval gasBox = GasEstimation.estimateWithP2PKHInputs(numInputs, numOutputs)\nprintln(s\"Gas required: ${gasBox.gas}\")\n```",
  "questions": "1. What is the purpose of the `GasEstimation` object?\n- The `GasEstimation` object is used to estimate gas consumption based on execution of various scripts in the Alephium project, including `UnlockScript` and `TxScript`.\n\n2. What is the `sweepAddress` method used for?\n- The `sweepAddress` method is used to estimate gas consumption for a P2PKH input.\n\n3. What is the purpose of the `estimateInputGas` method?\n- The `estimateInputGas` method is used to estimate gas consumption for a given `UnlockScript`, including P2PKH, P2MPKH, and P2SH scripts. It also takes into account any previous gas consumption."
}